#include "LexicalAnalyzer.h"
#include <stdio.h>

///=================================================================================================
/// \fn int main()
///
/// \brief 多行注释测试
///
/// \date 2018/5/26
///
/// \return Exit-code for the process - 0 for success, else an error code.
///=================================================================================================
/*********************************************************
1
2
3
4
*/

int func() {
    int a, c;//单行注释测试
    a = 20152109;//数字串测试
    a >>= 1;//多符号运算符测试
    int b = a - c; //运算符测试
    return 0;
}